<a href="https://colab.research.google.com/github/clroger/Learning-RSpark/blob/master/10_minutes_to_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

http://pandas.pydata.org/pandas-docs/stable/10min.html

# 10 Minutes to pandas

This is a short introduction to pandas, geared mainly for new users. You can see more complex recipes in the [Cookbook](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook)

Customarily, we import as follows:

In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [0]:
!wget https://www.dropbox.com/s/8grgwn4b6y25frw/titanic.csv
data = pd.read_csv('titanic.csv')

--2019-01-13 23:30:17--  https://www.dropbox.com/s/8grgwn4b6y25frw/titanic.csv
Resolving www.dropbox.com (www.dropbox.com)... 162.125.9.1, 2620:100:601f:1::a27d:901
Connecting to www.dropbox.com (www.dropbox.com)|162.125.9.1|:443... connected.
HTTP request sent, awaiting response... 301 Moved Permanently
Location: /s/raw/8grgwn4b6y25frw/titanic.csv [following]
--2019-01-13 23:30:17--  https://www.dropbox.com/s/raw/8grgwn4b6y25frw/titanic.csv
Reusing existing connection to www.dropbox.com:443.
HTTP request sent, awaiting response... 302 Found
Location: https://uca3132b57fea7c78c1507010693.dl.dropboxusercontent.com/cd/0/inline/AZVyU0Zv3tLPTOMntvlqQWXyNCJ8ecgq6FUcUyux5L2kZAY3dxq-xQhikEZlgDTKcTD43vzUrOGU6grCc1t1PXQVVP228ZbCMVaj6ws2lkYNrpeZiPh3DKN0OoxO-vInJ7Xs465COg0Bk5gnrK6t40N80Pq3dDEU2p_wCinAkD5V-kzdl20l4pUcdoI04wu20HI/file [following]
--2019-01-13 23:30:17--  https://uca3132b57fea7c78c1507010693.dl.dropboxusercontent.com/cd/0/inline/AZVyU0Zv3tLPTOMntvlqQWXyNCJ8ecgq6FUcUyux5L2kZAY3dxq-xQhikEZlgDTKcTD43vzUrOGU6grCc1t1PXQVVP228ZbCMVaj6ws2lkYNrpeZiPh3DKN0OoxO-vInJ7Xs465COg0Bk5gnrK6t40N80Pq3dDEU2p_wCinAkD5V-kzdl20l4pUcdoI04wu20HI/file
Resolving uca3132b57fea7c78c1507010693.dl.dropboxusercontent.com (uca3132b57fea7c78c1507010693.dl.dropboxusercontent.com)... 162.125.9.6, 2620:100:601f:6::a27d:906
Connecting to uca3132b57fea7c78c1507010693.dl.dropboxusercontent.com (uca3132b57fea7c78c1507010693.dl.dropboxusercontent.com)|162.125.9.6|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 60302 (59K) [text/plain]
Saving to: ‘titanic.csv.1’

titanic.csv.1       100%[===================>]  58.89K  --.-KB/s    in 0.04s

2019-01-13 23:30:17 (1.62 MB/s) - ‘titanic.csv.1’ saved [60302/60302]

In [0]:
%matplotlib inline

## Object Creation

See the [Data Structure Intro section](http://pandas.pydata.org/pandas-docs/stable/dsintro.html#dsintro)

Creating a Series by passing a list of values, letting pandas create a default integer index:

In [0]:
s = pd.Series([1,3,5,np.nan,6,8])

In [0]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns:

In [0]:
dates = pd.date_range('20130101', periods=6)

In [0]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [0]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [0]:
df

                   A         B         C         D
2013-01-01  1.109651  1.208421 -0.761615 -0.007067
2013-01-02 -0.318951 -0.669711  0.189250  0.904125
2013-01-03  0.140626  1.950451  1.270627 -0.941929
2013-01-04 -0.298729  0.483547  0.711029 -0.878140
2013-01-05  0.886283 -0.327976 -1.399314 -1.418294
2013-01-06 -1.666753  0.587278  0.479447 -1.138145

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [0]:
df2 = pd.DataFrame({'A':1.,
                   'B':pd.Timestamp('20130102'),
                   'C':pd.Series(1,index=list(range(3,7)),dtype='float32'),
                   'D':np.array([3]*4,dtype='int32'),
                   'E':pd.Categorical(["test","train","test","train"]),
                   'F':'foo'})

In [0]:
df2

     A          B    C  D      E    F
3  1.0 2013-01-02  1.0  3   test  foo
4  1.0 2013-01-02  1.0  3  train  foo
5  1.0 2013-01-02  1.0  3   test  foo
6  1.0 2013-01-02  1.0  3  train  foo

Having specific [dtypes](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-dtypes)

In [0]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

If you’re using IPython, tab completion for column names (as well as public attributes) is automatically enabled. Here’s a subset of the attributes that will be completed:

In [0]:
# df2.<TAB>

As you can see, the columns A, B, C, and D are automatically tab completed. E is there as well; the rest of the attributes have been truncated for brevity.

In [0]:
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [0]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [0]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Viewing Data

See the [Basics section](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics)

See the top & bottom rows of the frame

In [0]:
df.head()

                   A         B         C         D
2013-01-01 -0.873730 -0.313265 -0.948619 -0.945572
2013-01-02  1.922248 -0.163636 -0.996819 -0.161202
2013-01-03  0.465146 -1.556143  0.543273 -0.039261
2013-01-04  0.242522  0.402289  0.931186  0.418055
2013-01-05  0.775735  0.927382  0.460234  1.822003

In [0]:
df.tail(3)

                   X         Y         Z         L
2013-01-04  0.101939  0.749480  0.700141  0.166482
2013-01-05  0.418279 -0.158822 -0.376630 -1.279395
2013-01-06 -2.210900 -2.232787 -0.656006 -0.287469

Display the index, columns, and the underlying numpy data

In [0]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [0]:
df.columns = ['X', 'Y', "Z", "L"]

In [0]:
df[['X','Y']]

                   X         Y
2013-01-01 -0.659391 -0.752060
2013-01-02 -1.477392 -0.688350
2013-01-03  0.573114 -0.237978
2013-01-04  0.101939  0.749480
2013-01-05  0.418279 -0.158822
2013-01-06 -2.210900 -2.232787

In [0]:
df.values

array([[-0.65939102, -0.75206013,  2.296618  ,  0.38540103],
       [-1.47739192, -0.68835004,  0.48806622, -0.14273224],
       [ 0.5731136 , -0.23797777, -1.10637108,  0.91071775],
       [ 0.10193924,  0.74948026,  0.70014131,  0.16648245],
       [ 0.41827918, -0.15882206, -0.37662979, -1.27939514],
       [-2.21090044, -2.23278694, -0.6560063 , -0.28746947]])

Describe shows a quick statistic summary of your data

In [0]:
df.describe()

Transposing your data

In [0]:
df.T

Sorting by an axis

In [0]:
df.sort_index(axis=1, ascending=False)

                   Z         Y         X         L
2013-01-01  2.296618 -0.752060 -0.659391  0.385401
2013-01-02  0.488066 -0.688350 -1.477392 -0.142732
2013-01-03 -1.106371 -0.237978  0.573114  0.910718
2013-01-04  0.700141  0.749480  0.101939  0.166482
2013-01-05 -0.376630 -0.158822  0.418279 -1.279395
2013-01-06 -0.656006 -2.232787 -2.210900 -0.287469

Sorting by value

In [0]:
df.sort_values(by='B')

## Selection

**Note:** While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods, .at, .iat, .loc, .iloc and .ix.

See the indexing documentation [Indexing and Selecting Data](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing) and [MultiIndex / Advanced Indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced)

### Getting

Selecting a single column, which yields a Series, equivalent to df.A

In [0]:
df['A']

2013-01-01   -0.873730
2013-01-02    1.922248
2013-01-03    0.465146
2013-01-04    0.242522
2013-01-05    0.775735
2013-01-06    0.805438
Freq: D, Name: A, dtype: float64

Selecting via [], which slices the rows.

In [0]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.873730 -0.313265 -0.948619 -0.945572
2013-01-02  1.922248 -0.163636 -0.996819 -0.161202
2013-01-03  0.465146 -1.556143  0.543273 -0.039261

In [0]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.922248 -0.163636 -0.996819 -0.161202
2013-01-03  0.465146 -1.556143  0.543273 -0.039261
2013-01-04  0.242522  0.402289  0.931186  0.418055

### Selection by Label

See more in [Selection by Label](Selection by Label)

For getting a cross section using a label

In [0]:
df.loc[dates[0]]

A   -0.873730
B   -0.313265
C   -0.948619
D   -0.945572
Name: 2013-01-01 00:00:00, dtype: float64

Selection by Label

In [0]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.873730 -0.313265
2013-01-02  1.922248 -0.163636
2013-01-03  0.465146 -1.556143
2013-01-04  0.242522  0.402289
2013-01-05  0.775735  0.927382
2013-01-06  0.805438  0.816000

Showing label slicing, both endpoints are included

In [0]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  1.922248 -0.163636
2013-01-03  0.465146 -1.556143
2013-01-04  0.242522  0.402289

Reduction in the dimensions of the returned object

In [0]:
df.loc['20130102',['A','B']]

A    1.922248
B   -0.163636
Name: 2013-01-02 00:00:00, dtype: float64

For getting a scalar value

In [0]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [0]:
df.loc[dates[0],'A']

-0.8737302352101003

### Selection by Position

See more in [Selection by Position](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-integer)

Select via the position of the passed integers

In [0]:
df.iloc[3]

A    0.242522
B    0.402289
C    0.931186
D    0.418055
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python

In [0]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.242522  0.402289
2013-01-05  0.775735  0.927382

By lists of integer position locations, similar to the numpy/python style

In [0]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.922248 -0.996819
2013-01-03  0.465146  0.543273
2013-01-05  0.775735  0.460234

For slicing rows explicitly

In [0]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  1.922248 -0.163636 -0.996819 -0.161202
2013-01-03  0.465146 -1.556143  0.543273 -0.039261

For slicing columns explicitly

In [0]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.313265 -0.948619
2013-01-02 -0.163636 -0.996819
2013-01-03 -1.556143  0.543273
2013-01-04  0.402289  0.931186
2013-01-05  0.927382  0.460234
2013-01-06  0.816000  0.444233

For getting a value explicitly

In [0]:
df.iloc[1,1]

For getting fast access to a scalar (equiv to the prior method)

In [0]:
df.iat[1,1]

-0.16363550619697376

## Boolean Indexing

Using a single column’s values to select data.

In [0]:
tmp = df[['B','C']]

In [0]:
tmp.loc['2013-01-02']['B'] = 555

In [0]:
tmp

                     B         C
2013-01-01   -0.313265 -0.948619
2013-01-02  555.000000 -0.996819
2013-01-03   -1.556143  0.543273
2013-01-04    0.402289  0.931186
2013-01-05    0.927382  0.460234
2013-01-06    0.816000  0.444233

In [0]:
df

                   A         B         C         D
2013-01-01 -0.873730 -0.313265 -0.948619 -0.945572
2013-01-02  1.922248 -0.163636 -0.996819 -0.161202
2013-01-03  0.465146 -1.556143  0.543273 -0.039261
2013-01-04  0.242522  0.402289  0.931186  0.418055
2013-01-05  0.775735  0.927382  0.460234  1.822003
2013-01-06  0.805438  0.816000  0.444233  0.703847

In [0]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  1.922248 -0.163636 -0.996819 -0.161202
2013-01-03  0.465146 -1.556143  0.543273 -0.039261
2013-01-04  0.242522  0.402289  0.931186  0.418055
2013-01-05  0.775735  0.927382  0.460234  1.822003
2013-01-06  0.805438  0.816000  0.444233  0.703847

A where operation for getting.

In [0]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02  1.922248       NaN       NaN       NaN
2013-01-03  0.465146       NaN  0.543273       NaN
2013-01-04  0.242522  0.402289  0.931186  0.418055
2013-01-05  0.775735  0.927382  0.460234  1.822003
2013-01-06  0.805438  0.816000  0.444233  0.703847

Using the isin() method for filtering:

In [0]:
df2 = df.copy()

In [0]:
df2['E'] = ['one','one', 'two','three','four','three']

In [0]:
df2

In [0]:
df2[df2['E'].isin(['two','four'])]

## Setting

Setting a new column automatically aligns the data by the indexes

In [0]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102',periods=6))

In [0]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [0]:
df['F'] = s1

Setting values by label

In [0]:
df.at[dates[0],'A'] = 0

Settomg values by position

In [0]:
df.iat[0,1] = 0

Setting by assigning with a numpy array

In [0]:
df.loc[:,'D'] = np.array([5] * len(df))

The result of the prior setting operations

In [0]:
df

A where operation with setting.

In [0]:
df2 = df.copy()

In [0]:
df2[df2 > 0] = -df2

In [0]:
df2

## Missing Data

pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the Missing Data section

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [0]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [0]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [0]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.948619  5  NaN  1.0
2013-01-02  1.922248 -0.163636 -0.996819  5  1.0  1.0
2013-01-03  0.465146 -1.556143  0.543273  5  2.0  NaN
2013-01-04  0.242522  0.402289  0.931186  5  3.0  NaN

To drop any rows that have missing data.

In [0]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  1.922248 -0.163636 -0.996819  5  1.0  1.0

Filling missing data

In [0]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.948619  5  5.0  1.0
2013-01-02  1.922248 -0.163636 -0.996819  5  1.0  1.0
2013-01-03  0.465146 -1.556143  0.543273  5  2.0  5.0
2013-01-04  0.242522  0.402289  0.931186  5  3.0  5.0

To get the boolean mask where values are nan

In [0]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Operations

See the [Basic section on Binary Ops](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-binop)

### Stats

Operations in general exclude missing data.

Performing a descriptive statistic

In [0]:
df.mean()

A    0.701848
B    0.070982
C    0.072248
D    5.000000
F    3.000000
dtype: float64

Same operation on the other axis

In [0]:
df.mean(1)

2013-01-01    1.012845
2013-01-02    1.352359
2013-01-03    1.290455
2013-01-04    1.915199
2013-01-05    2.232670
2013-01-06    2.413134
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension.

In [0]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [0]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [0]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.534854 -2.556143 -0.456727  4.0  1.0
2013-01-04 -2.757478 -2.597711 -2.068814  2.0  0.0
2013-01-05 -4.224265 -4.072618 -4.539766  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

### Apply

Applying functions to the data

In [0]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.948619   5   NaN
2013-01-02  1.922248 -0.163636 -1.945438  10   1.0
2013-01-03  2.387394 -1.719778 -1.402165  15   3.0
2013-01-04  2.629916 -1.317489 -0.470979  20   6.0
2013-01-05  3.405651 -0.390107 -0.010745  25  10.0
2013-01-06  4.211089  0.425893  0.433488  30  15.0

In [0]:
df.apply(lambda x: x.max() - x.min())

A    1.922248
B    2.483525
C    1.928005
D    0.000000
F    4.000000
dtype: float64

### Histogramming

See more at [Histogramming and Discretization](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-discretization)

In [0]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [0]:
s

0    1
1    0
2    3
3    3
4    4
5    5
6    1
7    2
8    1
9    2
dtype: int64

In [0]:
s.value_counts()

1    3
3    2
2    2
5    1
4    1
0    1
dtype: int64

### String Methods

Series is equipped with a set of string processing methods in the str attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in str generally uses [regular expressions](https://docs.python.org/2/library/re.html) by default (and in some cases always uses them). See more at [Vectorized String Methods](http://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods).

In [0]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [0]:
s.str.lower()

## Merge

### Concat

pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

See the [Merging section](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging)

Concatenating pandas objects together with concat():

In [0]:
df = pd.DataFrame(np.random.randn(10, 4))

In [0]:
df

In [0]:
# break it into pieces
pieces = [df[:3], df[3:7], df[7:]]

In [0]:
pd.concat(pieces)

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.948619  5  NaN
2013-01-02  1.922248 -0.163636 -0.996819  5  1.0
2013-01-03  0.465146 -1.556143  0.543273  5  2.0
2013-01-04  0.242522  0.402289  0.931186  5  3.0
2013-01-05  0.775735  0.927382  0.460234  5  4.0
2013-01-06  0.805438  0.816000  0.444233  5  5.0

### Join

SQL style merges. See the [Database style joining](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-join)

In [0]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [0]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [0]:
left

   key  lval
0  foo     1
1  foo     2

In [0]:
right

   key  rval
0  foo     4
1  foo     5

In [0]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

### Append

Append rows to a dataframe. See the [Appending](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-concatenation)

In [0]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

In [0]:
df

In [0]:
s = df.iloc[3]

In [0]:
df.append(s, ignore_index=True)

## Grouping

By “group by” we are referring to a process involving one or more of the following steps

* **Splitting** the data into groups based on some criteria
* **Applying** a function to each group independently
* **Combining** the results into a data structure

See the [Grouping section](http://pandas.pydata.org/pandas-docs/stable/groupby.html#groupby)

In [0]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                                    'B' : ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
                                    'C' : np.random.randn(8),
                                     'D' : np.random.randn(8)})

In [0]:
df

     A      B         C         D
0  foo    one -0.073835  0.002562
1  bar    one -0.414656  1.414238
2  foo    two  0.523676 -0.598471
3  bar  three  0.500749 -0.827899
4  foo    two -1.978023 -1.071233
5  bar    two -1.283217  0.311544
6  foo    one  1.100405 -0.481637
7  foo  three  0.230093 -1.462784

Grouping and then applying a function sum to the resulting groups.

In [0]:
df.groupby('A').sum()

            C         D
A
bar -1.197124  0.897883
foo -0.197684 -3.611565

In [0]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.414656  1.414238
    three  0.500749 -0.827899
    two   -1.283217  0.311544
foo one    1.026569 -0.479076
    three  0.230093 -1.462784
    two   -1.454346 -1.669704

## Reshaping

See the sections on [Hierarchical Indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced-hierarchical) and [Reshaping](http://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-stacking).

### Stack

In [0]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
                                ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))

In [0]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [0]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [0]:
df2 = df[:4]

In [0]:
df2

The stack() method “compresses” a level in the DataFrame’s columns.

In [0]:
stacked = df2.stack()

In [0]:
stacked

With a “stacked” DataFrame or Series (having a MultiIndex as the index), the inverse operation of stack() is unstack(), which by default unstacks the **last level**:

In [0]:
stacked.unstack()

In [0]:
stacked.unstack(1)

In [0]:
stacked.unstack(0)

### Pivot Tables

See the section on [Pivot Tables](http://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-pivot).

In [0]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                                    'B' : ['A', 'B', 'C'] * 4,
                                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                                    'D' : np.random.randn(12),
                                    'E' : np.random.randn(12)})

In [0]:
df

We can produce pivot tables from this data very easily:

In [0]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

## Time Series

pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limited to, financial applications. See the [Time Series section](http://pandas.pydata.org/pandas-docs/stable/timeseries.html#timeseries)

In [0]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [0]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [0]:
ts.resample('5Min').sum()

Time zone representation

In [0]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [0]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [0]:
ts

In [0]:
ts_utc = ts.tz_localize('UTC')

In [0]:
ts_utc


Convert to another time zone

In [0]:
ts_utc.tz_convert('US/Eastern')


Converting between time span representations

In [0]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')

In [0]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [0]:
ts

In [0]:
ps = ts.to_period()

In [0]:
ps

In [0]:
ps.to_timestamp()

Converting between period and timestamp enables some convenient arithmetic functions to be used. In the following example, we convert a quarterly frequency with year ending in November to 9am of the end of the month following the quarter end:

In [0]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

In [0]:
ts = pd.Series(np.random.randn(len(prng)), prng)

In [0]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9

In [0]:
ts.head()

## Categoricals

Since version 0.15, pandas can include categorical data in a DataFrame. For full docs, see the [categorical introduction](http://pandas.pydata.org/pandas-docs/stable/categorical.html#categorical) and the [API documentation](http://pandas.pydata.org/pandas-docs/stable/api.html#api-categorical).

In [0]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

Convert the raw grades to a categorical data type.

In [0]:
df["grade"] = df["raw_grade"].astype("category")

In [0]:
df["grade"]

Rename the categories to more meaningful names (assigning to Series.cat.categories is inplace!)

In [0]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

Reorder the categories and simultaneously add the missing categories (methods under Series .cat return a new Series per default).

In [0]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [0]:
df["grade"]

Sorting is per order in the categories, not lexical order.

In [0]:
df.sort_values(by="grade")

Grouping by a categorical column shows also empty categories.

In [0]:
df.groupby("grade").size()

## Plotting
[Plotting](http://pandas.pydata.org/pandas-docs/stable/visualization.html#visualization) docs.

In [0]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))

In [0]:
ts = ts.cumsum()

In [0]:
ts.plot()

On DataFrame, plot() is a convenience to plot all of the columns with labels:

In [0]:
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index,
                  columns=['A', 'B', 'C', 'D'])

In [0]:
df = df.cumsum()

In [0]:
plt.figure(); df.plot(); plt.legend(loc='best')

In [0]:
df = pd.read_html()

## Getting Data In/Out

### CSV
[Writing to a csv file](http://pandas.pydata.org/pandas-docs/stable/io.html#io-store-in-csv)

In [0]:
df.to_csv('foo.csv')

[Reading from a csv file](http://pandas.pydata.org/pandas-docs/stable/io.html#io-read-csv-table)

In [0]:
pd.read_csv('foo.csv')

### HDF5
Reading and writing to [HDFStores](http://pandas.pydata.org/pandas-docs/stable/io.html#io-hdf5)

Writing to a HDF5 Store

In [0]:
df.to_hdf('foo.h5','df')

Reading from a HDF5 Store

In [0]:
pd.read_hdf('foo.h5','df')

### Excel

Reading and writing to [MS Excel](http://pandas.pydata.org/pandas-docs/stable/io.html#io-excel)

Writing to an excel file

In [0]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

Reading from an excel file

In [0]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

### Gotchas
If you are trying an operation and you see an exception like:

In [0]:
if pd.Series([False, True, False]):
    print("I was true")

See [Comparisons](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-compare) for an explanation and what to do.

See [Gotchas](http://pandas.pydata.org/pandas-docs/stable/gotchas.html#gotchas) as well.